var chaindata = {
    '分支': {
        '分离': ['切换', '划分', '释放', '分离', '隔离', '断开', '拆卸', '减去', '切除', '抛光', '磨削', '钻孔', '车削',],
        '精炼': ['净化', '应变', '过滤', '滤出', '清除',],
        '分布': ['发散', '散布', '分散', '扩散', '倒空', '吸收', '抵制', '消散',],
    },
    '导向': {
        '输入': ['输入', '接受', '允许', '进入', '捕获',],
        '输出': ['释放', '喷射', '部署', '删除',],
        '转移': ['提起', '移动', '传导', '输送',],
        '引导': ['指引', '矫直', '驾控', '翻转', '纺', '限制', '解锁', '转换',],
    },
    '连接': {
        '结合': ['紧固', '装配', '绑缚',],
        '混合': ['结合', '混合', '添加', '接合', '捆包',],
    },
    '控制': {
        '启动': ['开始', '激发',],
        '调节': ['控制', '允许', '预防', '启用', '禁用', '限制', '中断', '阀控',],
        '改变': ['增加', '减小', '放大', '减少', '扩大', '规格化', '比例变化', '矫正', '调节', '压紧', '压碎', '成型', '压缩', '戳穿', '限定',],
    },
    '转换': {
        '转换': ['变形', '液化', '固化', '气化', '浓缩', '集成', '区分', '处理',],
    },
    '供应': {
        '存储': ['包含', '收集', '储备', '捕获',],
        '供给': ['填充', '提供', '补充', '揭露',],
        '提取': ['提取',],
    },
    '信讯': {
        '感知': ['觉察', '确认', '识别', '检查', '定位',],
        '预示': ['标记',],
        '显示': ['显示',],
        '测量': ['计算',],
    },
    '支撑': {
        '停止': ['绝缘', '保护', '阻止', '防护', '限制',],
        '稳定': ['固定',],
        '保护': ['绑缚', '装上', '锁住', '锁紧', '把持',],
        '定位': ['定向', '排列', '位于',],
    },
};